# ParameterValuesConflict Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..ParameterValuesConflict Property
BuiltInFailures..::..GeneralFailures Class See Also
---
The value for [Parameter Name] must be at least [Value] below the value for [Parameter Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ParameterValuesConflict { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ParameterValuesConflict As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ParameterValuesConflict {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace